<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python52_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**데이터 프레임 합치기**
* merge/join: 두 개의 데이터 프레임을 공통된 컬럼을 기준으로 합치는 것.
* concat: 데이터 프레임의 축(axis)을 따라서 합치는 것.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({'key': ['a', 'a', 'b', 'b', 'a', 'c'],
                    'data1': range(6)})
df1

  key  data1
0   a      0
1   a      1
2   b      2
3   b      3
4   a      4
5   c      5

In [3]:
df2 = pd.DataFrame({'key': ['a', 'c', 'd'],
                    'data2': [10, 20, 30]})
df2

  key  data2
0   a     10
1   c     20
2   d     30

pandas.merge() 함수

In [8]:
m1 = pd.merge(left=df1, right=df2, on='key')  # how='inner' 기본값
m1

  key  data1  data2
0   a      0     10
1   a      1     10
2   a      4     10
3   c      5     20

pandas.DataFrame.merge() 메서드

In [9]:
m2 = df1.merge(df2, on='key')
m2

  key  data1  data2
0   a      0     10
1   a      1     10
2   a      4     10
3   c      5     20

In [11]:
# left join
m3 = pd.merge(left=df1, right=df2, how='left', on='key')
m3

  key  data1  data2
0   a      0   10.0
1   a      1   10.0
2   b      2    NaN
3   b      3    NaN
4   a      4   10.0
5   c      5   20.0

In [12]:
m4 = df1.merge(df2, how='left', on='key')
m4

  key  data1  data2
0   a      0   10.0
1   a      1   10.0
2   b      2    NaN
3   b      3    NaN
4   a      4   10.0
5   c      5   20.0

In [13]:
m5 = pd.merge(left=df1, right=df2, how='right', on='key')
m5

  key  data1  data2
0   a    0.0     10
1   a    1.0     10
2   a    4.0     10
3   c    5.0     20
4   d    NaN     30

In [14]:
m6 = pd.merge(left=df1, right=df2, how='outer', on='key')
m6

  key  data1  data2
0   a    0.0   10.0
1   a    1.0   10.0
2   a    4.0   10.0
3   b    2.0    NaN
4   b    3.0    NaN
5   c    5.0   20.0
6   d    NaN   30.0

pandas.merge() 함수의 Parameter들:
* left, right: merge/join할 데이터 프레임.
* how: merge/join 방법. inner(기본값), left, right, outer
* on: 데이터 프레임을 merge/join하는 기준이 되는 컬럼(들). 두 데이터 프레임이 같은 이름의 컬럼을 갖고 있는 경우.
* left_on, right_on: merge/join 기준이 되는 컬럼이 두 데이터 프레임에서 다른 이름일 때.
* left_index, right_index: 인덱스로 merge/join를 할 때. True/False(기본값).

In [15]:
employees = pd.DataFrame({'empno': [1001, 1002, 1003, 1101, 1102],
                          'deptno': [10, 10, 20, 30, np.nan]})
employees

   empno  deptno
0   1001    10.0
1   1002    10.0
2   1003    20.0
3   1101    30.0
4   1102     NaN

In [16]:
departments = pd.DataFrame({'dno': [10, 20, 30, 40],
                            'dname': ['Sales', 'HR', 'Accounting', 'Research']})
departments

   dno       dname
0   10       Sales
1   20          HR
2   30  Accounting
3   40    Research

In [17]:
emp_dept = pd.merge(left=employees, right=departments,
                    how='inner',
                    left_on='deptno', right_on='dno')
emp_dept

   empno  deptno  dno       dname
0   1001    10.0   10       Sales
1   1002    10.0   10       Sales
2   1003    20.0   20          HR
3   1101    30.0   30  Accounting

inner / left / right / outer join을 비교

In [20]:
employees.merge(departments, how='outer',
                left_on='deptno', right_on='dno')
# pd.merge(left=employees, right=departments, how='outer',
#          left_on='deptno', right_on='dno')

    empno  deptno   dno       dname
0  1001.0    10.0  10.0       Sales
1  1002.0    10.0  10.0       Sales
2  1003.0    20.0  20.0          HR
3  1101.0    30.0  30.0  Accounting
4  1102.0     NaN   NaN         NaN
5     NaN     NaN  40.0    Research

In [21]:
df3 = pd.DataFrame(data={'data1': range(6)},
                   index=['a', 'b', 'c'] * 2)
df3  # (6, 1) shape

   data1
a      0
b      1
c      2
a      3
b      4
c      5

In [22]:
df4 = pd.DataFrame(data={'data2': [11, 22, 33, 44]}, 
                   index=['a', 'b', 'c', 'd'])
df4  # (4, 1) shape

   data2
a     11
b     22
c     33
d     44

인덱스를 사용해서 merge/join

In [27]:
pd.merge(left=df3, right=df4, how='outer',
         left_index=True, right_index=True)
# how 값을 바꿔가면서 테스트.

   data1  data2
a    0.0     11
a    3.0     11
b    1.0     22
b    4.0     22
c    2.0     33
c    5.0     33
d    NaN     44

In [28]:
df5 = pd.DataFrame(data={'key': ['a', 'b', 'c'] * 2,
                         'data1': range(6)})
df5  # (6, 2) shape

  key  data1
0   a      0
1   b      1
2   c      2
3   a      3
4   b      4
5   c      5

In [30]:
pd.merge(left=df5, right=df4, how='inner',
         left_on='key', right_index=True)

  key  data1  data2
0   a      0     11
1   b      1     22
2   c      2     33
3   a      3     11
4   b      4     22
5   c      5     33